# Data preprocessing with Pandas

## Import libraries

In [1]:
import pandas as pd
import numpy as np

## Read csv file from disk into a dataframe

In [2]:
data = pd.read_csv('data/Sample_sheet.csv')

## Display the first few rows of the dataframe

In [3]:

data.head()

,S. No.,Names,Years of Experience,Domain,Relevant Experience,Income(USD),Marital Status,Number of siblings
0,1,John,8,Automotive,6.0,20000.0,Single,3
1,2,Jason,5,Entertainment,4.0,15000.0,Married,3
2,3,Maria,10,Banking,3.0,18000.0,Single,3
3,4,Jacob,12,Insurance,10.0,24000.0,Single,3
4,5,Sarah,15,Logistics,5.0,8000.0,Married,3

## Display columns from dataframe

In [4]:
data.columns

Index(['S. No.', 'Names', 'Years of Experience', 'Domain',
       'Relevant Experience', 'Income(USD)', 'Marital Status',
       'Number of siblings'],
      dtype='object')

## Display the data types of the columns in the dataframe

In [5]:
data.dtypes

S. No.                   int64
Names                   object
Years of Experience      int64
Domain                  object
Relevant Experience    float64
Income(USD)            float64
Marital Status          object
Number of siblings       int64
dtype: object

## Displaying DataFrame Information

The `info()` method provides a concise summary of the DataFrame. This includes:
 - the number of non-null entries in each column, 
 - the data type of each column, 
 - the memory usage of the DataFrame, and other useful information.

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 8 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   S. No.               10 non-null     int64
 1   Names                10 non-null     object
 2   Years of Experience  10 non-null     int64
 3   Domain               9 non-null      object
 4   Relevant Experience  9 non-null      float64
 5   Income(USD)          9 non-null      float64
 6   Marital Status       10 non-null     object
 7   Number of siblings   10 non-null     int64
dtypes: float64(2), int64(3), object(3)
memory usage: 768.0+ bytes

## Generating Descriptive Statistics for the Dataset

The `data.describe()` function in pandas is used to generate descriptive statistics of a **DataFrame** or **Series**. 

For numerical data, the result's index will include `count`, `mean`, `std`, `min`, `25%`, `50%`, `75%`, and `max`. These provide a statistical summary of the central tendency, dispersion, and shape of the distribution of the dataset, excluding `NaN` values.

In [7]:
data.describe()

,S. No.,Years of Experience,Relevant Experience,Income(USD),Number of siblings
count,10.00000,10.000000,9.000000,9.000000,10.0
mean,5.50000,7.800000,5.555556,14888.888889,3.0
std,3.02765,5.287301,3.745368,5883.120865,0.0
min,1.00000,0.000000,1.000000,7500.000000,3.0
25%,3.25000,3.500000,3.000000,9500.000000,3.0
50%,5.50000,8.000000,5.000000,15000.000000,3.0
75%,7.75000,11.500000,6.000000,19500.000000,3.0
max,10.00000,15.000000,13.000000,24000.000000,3.0

## Adding a New Column to the DataFrame
* The below statement adds a new column called "New_Column" to the dataframe "data". 
* The values in this new column are set to 1 using the `np.ones()` function.

In [8]:
data['New_Column'] = np.ones((10))

* Display the DataFrame in the output.
* The DataFrame "data" will be displayed in a tabular format

In [9]:
data

,S. No.,Names,Years of Experience,Domain,Relevant Experience,Income(USD),Marital Status,Number of siblings,New_Column
0,1,John,8,Automotive,6.0,20000.0,Single,3,1.0
1,2,Jason,5,Entertainment,4.0,15000.0,Married,3,1.0
2,3,Maria,10,Banking,3.0,18000.0,Single,3,1.0
3,4,Jacob,12,Insurance,10.0,24000.0,Single,3,1.0
4,5,Sarah,15,Logistics,5.0,8000.0,Married,3,1.0
5,6,Angelina,3,Travel,3.0,9500.0,Married,3,1.0
6,7,Krishna,0,NaN,NaN,NaN,Single,3,1.0
7,8,Adam,8,Food,5.0,7500.0,Single,3,1.0
8,9,Deepika,15,IT,13.0,19500.0,Married,3,1.0
9,10,Alan,2,Space,1.0,12500.0,Married,3,1.0

## Retrieving the Shape of the DataFrame

In [10]:
data.shape

(10, 9)

## Dropping a column
*  `data.drop('Column_label', axis = 1)` is used to remove a column from a DataFrame in pandas. 
*  The argument `'S. No.'` is the label of the column that you want to drop. 
*  The `axis = 1` parameter indicates that an entire column should be dropped. 
*  If `axis = 0`, it would indicate a row.

> This operation does not modify the original DataFrame by default. Instead, it returns a new DataFrame where the specified column is dropped. If you want to modify the original DataFrame, you would need to use the `inplace=True` argument like so: `data.drop('S. No.', axis = 1, inplace=True)`.

In [11]:
data.drop('S. No.', axis = 1)

,Names,Years of Experience,Domain,Relevant Experience,Income(USD),Marital Status,Number of siblings,New_Column
0,John,8,Automotive,6.0,20000.0,Single,3,1.0
1,Jason,5,Entertainment,4.0,15000.0,Married,3,1.0
2,Maria,10,Banking,3.0,18000.0,Single,3,1.0
3,Jacob,12,Insurance,10.0,24000.0,Single,3,1.0
4,Sarah,15,Logistics,5.0,8000.0,Married,3,1.0
5,Angelina,3,Travel,3.0,9500.0,Married,3,1.0
6,Krishna,0,NaN,NaN,NaN,Single,3,1.0
7,Adam,8,Food,5.0,7500.0,Single,3,1.0
8,Deepika,15,IT,13.0,19500.0,Married,3,1.0
9,Alan,2,Space,1.0,12500.0,Married,3,1.0

## Identifying Unique Categories in a Column"
* `data['Column_label'].unique()` is used to find the unique values in a column of the DataFrame named 'data'.
* In pandas, the `unique()` function is used to identify distinct values within a Series (a single column in a DataFrame is a Series). 
* This is useful when you're working with categorical data and you want to know what categories exist in the data without having to sort or filter the data manually.

In [12]:
data['Marital Status'].unique()

array(['Single', 'Married'], dtype=object)

## Calculating Correlation Matrix After Dropping Specific *Columns*

* `.corr()` function is used to calculate the correlation matrix.
* The `drop(['S. No.', 'Number of siblings', 'New_Column'], axis=1)` section removes the columns 'S. No.', 'Number of siblings', and 'New_Column' from the DataFrame as they either contain non-numeric data or are irrelevant.
* The `axis = 1` parameter indicates that these are column labels.

After these columns are dropped, the `corr()` function is called on the resulting DataFrame. 
* The `corr()` function calculates the pairwise correlation of columns, excluding NA/null values. 
* The output is a correlation matrix, which is a table showing correlation coefficients between variables. 
* Each cell in the table shows the correlation between two variables.

The correlation coefficient is a statistical measure that calculates the strength of the relationship between the relative movements of two variables. The values range between -1.0 and 1.0. A correlation of -1.0 shows a perfect negative correlation, while a correlation of 1.0 shows a perfect positive correlation. A correlation of 0.0 shows no linear relationship between the movement of the two variables.

In [26]:
correlation = data.drop(['S. No.', 'Number of siblings', 'New_Column'], axis = 1).corr()

# Display correlation matrix in a tabular form
from IPython.display import display, HTML

display(HTML(correlation._repr_html_()))

C:\Users\Praveen_Prabha_Ravin\AppData\Local\Temp\ipykernel_8860\1922322742.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  correlation = data.drop(['S. No.', 'Number of siblings', 'New_Column'], axis = 1).corr()

## Write dataframe to a csv file

In [30]:
correlation.to_csv('data/output/Corr.csv')

## Setting a Specific DataFrame Value

* `data.loc[2, 'Marital Status'] = np.nan` uses the `loc` function from pandas to access a specific location in the DataFrame `data` and assign a new value to it.
* The `loc` function is a label-based data selection method which means that we have to pass the name of the row or column which we want to select. 
* This method includes the last element of the range passed in it, unlike `iloc` which is an index-based method.
* In this case, `2` is the label of the row, and `'Marital Status'` is the label of the column. The value at this location is being set to `np.nan`, which represents a missing or null value in pandas.

In [33]:
data.loc[2, 'Marital Status'] = np.nan
display(HTML(data._repr_html_()))

## Imputing Missing Values with Different Strategies
The `SimpleImputer` class from the `sklearn.impute` module can be used to handle missing data in numerical or categorical columns. It allows you to replace missing values using various strategies.

In [20]:
# import SimpleImputer class
from sklearn.impute import SimpleImputer

In [37]:
data['Marital Status']

0     Single
1    Married
2        NaN
3     Single
4    Married
5    Married
6     Single
7     Single
8    Married
9    Married
Name: Marital Status, dtype: object


### Imputing Missing Values with Most Frequent Value

The code snippet below demonstrates how to use the `SimpleImputer` class from the scikit-learn library to impute missing values in a column with the most frequent value:

* `SimpleImputer(strategy='most_frequent')` creates an instance of the `SimpleImputer` class with the 'most_frequent' strategy. 
* This strategy fills missing values with the most frequent value in the specified column.
* `imputer_most_frequent.fit_transform(data[['Marital Status']])` applies the imputation to the specified column ('Marital Status') in the DataFrame `data`. The missing values are replaced with the most frequent value.
* The output, is a new DataFrame where missing values in the 'Marital Status' column have been replaced with the most frequent value.

> **Notes:**  
>  * The Original DataFrame is not miodified by this operation.
>  * If you want to replace the original column with the imputed one, you would need to assign the result back to the column in the original DataFrame.
>  * The double square brackets (`[['Marital Status']]`) are used to keep the result as a DataFrame. If single square brackets were used (`['Marital Status']`), the result would be a Series instead.

In [46]:
# Create an instance of SimpleImputer with the 'most_frequent' strategy
imputer_most_frequent = SimpleImputer(strategy = 'most_frequent')

# Fit and transform the data, replacing missing values in the 'Marital Status' column
imputer_most_frequent.fit_transform(data[['Marital Status']])

array([['Single'],
       ['Married'],
       ['Married'],
       ['Single'],
       ['Married'],
       ['Married'],
       ['Single'],
       ['Single'],
       ['Married'],
       ['Married']], dtype=object)

### Imputing Missing Values with Mean

* `SimpleImputer(strategy = 'mean')` creates an instance of the `SimpleImputer` class with the 'mean' strategy.
* The 'mean' strategy means that the mean value of the column will be used to fill in the missing values.
* This strategy can only be used with numerical data.
* `imputer_mean.fit_transform(data[['Income(USD)']])` applies the imputation to the specified column ('Income(USD)')

In [45]:
imputer_mean = SimpleImputer(strategy = 'mean')
imputer_mean.fit_transform(data[['Income(USD)']])

array([[20000.        ],
       [15000.        ],
       [18000.        ],
       [24000.        ],
       [ 8000.        ],
       [ 9500.        ],
       [14888.88888889],
       [ 7500.        ],
       [19500.        ],
       [12500.        ]])

### Imputing Missing Values with Median

* `SimpleImputer(strategy = 'median')` creates an instance of the `SimpleImputer` class with the 'median' strategy.
* The 'median' strategy means that the median value of the column will be used to fill in the missing values.
* This strategy can only be used with numerical data.
* `imputer_median.fit_transform(data[['Income(USD)']])` applies the imputation to the specified column ('Income(USD)')

In [41]:
imputer_median = SimpleImputer(strategy = 'median')
imputer_median.fit_transform(data[['Income(USD)']])

array([[20000.],
       [15000.],
       [18000.],
       [24000.],
       [ 8000.],
       [ 9500.],
       [15000.],
       [ 7500.],
       [19500.],
       [12500.]])

### Imputing Missing Values with a Constant

* `SimpleImputer(strategy = 'constant', fill_value = 7000)` creates an instance of the `SimpleImputer` class with the 'constant' strategy.
* The 'constant' strategy means that a constant value (7000 in this case) will be used to fill in the missing values.
* This strategy can be used with both numerical and categorical data.
* `imputer_constant.fit_transform(data[['Income(USD)']])` applies the imputation to the specified column ('Income(USD)')

In [42]:
imputer_constant = SimpleImputer(strategy = 'constant', fill_value = 7000)
imputer_constant.fit_transform(data[['Income(USD)']])

array([[20000.],
       [15000.],
       [18000.],
       [24000.],
       [ 8000.],
       [ 9500.],
       [ 7000.],
       [ 7500.],
       [19500.],
       [12500.]])